Catalogs/ОКПД2ПоВидамПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОКПД2ПоВидамПродукцииИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодЧЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СтатусыКлассификаторовВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыКлассификаторовВидовПродукцииИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действующий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архивный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОКПД2ПоВидамПродукцииИС/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.РаботаСНоменклатурой.ОблачныеКлассификаторы") Тогда
		Элементы.ФормаОбновитьИзКлассификатора.Видимость = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ОКПД2ПоВидамПродукцииИС" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьИзКлассификатора(Команда)
	
	ОбновитьДанныеИзКлассификатора(
		ПолучитьКодыДляЗагрузки());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзКлассификатораДляВыбранныхСтрок(Команда)
	
	ОбновитьДанныеИзКлассификатора(
		ПолучитьКодыДляЗагрузки(Элементы.Список.ВыделенныеСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанных(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ЗагрузкаТНВЭДиОКПД2ИС");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДанныеИзКлассификатора(КодыДляЗагрузки)
	
	Если КодыДляЗагрузки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Данные для обновления отсутствуют'"));
	Иначе
		ОчиститьСообщения();
		ЗагрузитьДанныеКлассификатора(КодыДляЗагрузки);
		Для Каждого КодДляЗагрузки Из КодыДляЗагрузки Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Не найдены данные по коду %1'"),
				КодДляЗагрузки));
		КонецЦикла;
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКодыДляЗагрузки(знач Ссылки = Неопределено)
	
	Запрос = Новый Запрос;
	
	Если Ссылки = Неопределено Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОКПД2ПоВидамПродукцииИС.КодЧЗ
		|ИЗ
		|	Справочник.ОКПД2ПоВидамПродукцииИС КАК ОКПД2ПоВидамПродукцииИС
		|ГДЕ
		|	ОКПД2ПоВидамПродукцииИС.КодЧЗ <> """"
		|	И ОКПД2ПоВидамПродукцииИС.Код = """"
		|	И ОКПД2ПоВидамПродукцииИС.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)";
	Иначе
		Запрос.УстановитьПараметр("Ссылки", Ссылки);
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОКПД2ПоВидамПродукцииИС.КодЧЗ
		|ИЗ
		|	Справочник.ОКПД2ПоВидамПродукцииИС КАК ОКПД2ПоВидамПродукцииИС
		|ГДЕ
		|	ОКПД2ПоВидамПродукцииИС.Ссылка В (&Ссылки)
		|	И ОКПД2ПоВидамПродукцииИС.КодЧЗ <> """"";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КодЧЗ");
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗагрузитьДанныеКлассификатора(КодыДляЗагрузки)
	
	ТаблицаКодов = Новый ТаблицаЗначений;
	ТаблицаКодов.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ТаблицаКодов.Колонки.Добавить("КодЧЗ", ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ТаблицаКодов.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаКодов.Колонки.Добавить("НаименованиеПолное", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	ТаблицаКодов.Индексы.Добавить("Код");
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("НомерСтраницы", 0);
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
	
	МодульОблачныеКлассификаторы = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ОблачныеКлассификаторы");
	ВГраница = КодыДляЗагрузки.ВГраница();
	Для Индекс = 0 По ВГраница Цикл
		ТекущийИндекс = ВГраница - Индекс;
		КодДляЗагрузки = КодыДляЗагрузки[ТекущийИндекс];
		ПараметрыВыполнения.Вставить("СтрокаПоиска", КодДляЗагрузки);
		МодульОблачныеКлассификаторы.ОбработатьПоисковыйЗапросОКПД2(ПараметрыВыполнения, АдресРезультата);
		Если ДополнитьТаблицуКодов(ТаблицаКодов, КодДляЗагрузки, АдресРезультата) Тогда
			КодыДляЗагрузки.Удалить(ТекущийИндекс);
		КонецЕсли;
	КонецЦикла;
	
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	ЗагрузитьТаблицуКодов(ТаблицаКодов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДополнитьТаблицуКодов(ТаблицаКодов, КодДляЗагрузки, АдресРезультата)
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	ДлинаКодаДляЗагрузки = СтрДлина(КодДляЗагрузки);
	
	Данные = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Данные) = Тип("ТаблицаЗначений")
		И Данные.Количество() > 0 Тогда
		Для Каждого СтрокаДанных Из Данные Цикл
			Если ЗначениеЗаполнено(СтрокаДанных.ДатаОкончанияДействия)
				И СтрокаДанных.ДатаОкончанияДействия < ТекущаяДата Тогда
				Продолжить;
			КонецЕсли;
			ДлинаКода = СтрДлина(СтрокаДанных.Код);
			Если ДлинаКода < 12
				И СтрокаДанных.Код <> КодДляЗагрузки Тогда
				Продолжить;
			КонецЕсли;
			Если Лев(СтрокаДанных.Код, ДлинаКодаДляЗагрузки) <> КодДляЗагрузки Тогда
				Продолжить;
			КонецЕсли;
			НайденнаяСтрока = ТаблицаКодов.Найти(СтрокаДанных.Код, "Код");
			Если НайденнаяСтрока = Неопределено Тогда
				Строка = ТаблицаКодов.Добавить();
				Строка.Код = СтрокаДанных.Код;
				Строка.КодЧЗ = КодДляЗагрузки;
				Строка.Наименование = СтрокаДанных.Наименование;
				Строка.НаименованиеПолное = СтрокаДанных.Наименование;
			ИначеЕсли ДлинаКодаДляЗагрузки > СтрДлина(НайденнаяСтрока.КодЧЗ) Тогда
				НайденнаяСтрока.КодЧЗ = КодДляЗагрузки;
			КонецЕсли;
		КонецЦикла;
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗагрузитьТаблицуКодов(ТаблицаКодов)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Таблица = ТаблицаКодов.Скопировать(, "Код,КодЧЗ");
	
	ДобавитьВТаблицуКолонкуИндекс(Таблица);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Код,
	|	Таблица.КодЧЗ,
	|	Таблица.Индекс
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ
	|	Таблица.Индекс КАК Индекс,
	|	ОКПД2ПоКодуЧЗ.ВидПродукции КАК ВидПродукцииЧЗ,
	|	ОКПД2ПоКоду.Ссылка КАК СсылкаПоКоду
	|ИЗ
	|	Таблица КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОКПД2ПоВидамПродукцииИС КАК ОКПД2ПоКодуЧЗ
	|	ПО Таблица.КодЧЗ = ОКПД2ПоКодуЧЗ.КодЧЗ
	|		И (ОКПД2ПоКодуЧЗ.Код = """" ИЛИ ОКПД2ПоКодуЧЗ.КодЧЗ = ОКПД2ПоКодуЧЗ.Код)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОКПД2ПоВидамПродукцииИС КАК ОКПД2ПоКоду
	|	ПО ВЫБОР КОГДА ОКПД2ПоКоду.Код = """"
	|		ТОГДА Таблица.Код = ОКПД2ПоКоду.КодЧЗ
	|		ИНАЧЕ Таблица.Код = ОКПД2ПоКоду.Код КОНЕЦ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			Строка = ТаблицаКодов[Выборка.Индекс];
			Если ЗначениеЗаполнено(Выборка.СсылкаПоКоду) Тогда
				ЭлементСправочника = Выборка.СсылкаПоКоду.ПолучитьОбъект();
			Иначе
				ЭлементСправочника = Справочники.ОКПД2ПоВидамПродукцииИС.СоздатьЭлемент();
				ЭлементСправочника.КодЧЗ = Строка.КодЧЗ;
				ЭлементСправочника.ВидПродукции = Выборка.ВидПродукцииЧЗ;
				ЭлементСправочника.Статус = Перечисления.СтатусыКлассификаторовВидовПродукцииИС.Действующий;
			КонецЕсли;
			ЭлементСправочника.Код = Строка.Код;
			ЭлементСправочника.Наименование = Строка.Наименование;
			ЭлементСправочника.НаименованиеПолное = Строка.НаименованиеПолное;
			ЭлементСправочника.ДатаИзменения = ТекущаяДата;
			ЭлементСправочника.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьВТаблицуКолонкуИндекс(Таблица)
	
	Таблица.Колонки.Добавить("Индекс", ОбщегоНазначения.ОписаниеТипаЧисло(6));
	
	Индекс = 0;
	Для Каждого Строка Из Таблица Цикл
		Строка.Индекс = Индекс;
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
